const HowToUsePage = () => {
  return (
    <div className="p-3">
      <div>
        <strong className="p-3">커뮤니티 이용규칙</strong>
        <hr />
      </div>

      <div className="">
        <strong className="p-3">커뮤니티 운영 시스템</strong>
        <br />
        <div className=" p-3">
          <p>
            커뮤니티 이용규칙은 누구나 기분 좋게 참여할 수 있는 커뮤니티를
            만들기 위해 제정되었습니다. 서비스 내 모든 커뮤니티는 커뮤니티
            이용규칙에 의해 운영되므로, 이용자는 커뮤니티 이용 전 반드시 모든
            내용을 숙지하여야 합니다.
            <br />
            <br />
            방송통신심의위원회의 정보통신에 관한 심의규정, 현행 법률, 서비스
            이용약관 및 커뮤니티 이용규칙을 위반하거나, 사회 통념 및 관련 법령을
            기준으로 타 이용자에게 악영향을 끼치는 경우, 게시물이 삭제되고
            서비스 이용이 일정 기간 제한될 수 있습니다.
            <br />
            <br />
            커뮤니티 이용규칙은 불법 행위, 각종 차별 및 혐오, 사회적 갈등 조장,
            타인의 권리 침해, 다른 이용자에게 불쾌감을 주는 행위, 커뮤니티 유출
            행위, 시스템 장애를 유발하는 비정상 행위 등 커뮤니티 분위기 형성과
            운영에 악영향을 미치는 행위들을 제한하기 위해 지속적으로 개정됩니다.
            중대한 변경 사항이 있는 경우에는 공지사항을 통해 고지하므로 반드시
            확인해주시기 바랍니다.
            <br />
            <br />
            커뮤니티 이용규칙에서 사용된 용어의 정의는 서비스 이용약관을
            따릅니다.
          </p>
        </div>
      </div>
      <br />
      <div>
        <strong className="p-3">커뮤니티 운영 시스템</strong>
        <br />
        <div className="small-font p-3">
          <p>
            커뮤니티 운영 시스템은 서비스 이용약관 및 커뮤니티 이용규칙 위반을
            빠르게 감지하고 조치하기 위해 도입되었습니다. 또한 현행 법률에 따른
            청소년유해매체물, 권리 침해, 비정상적인 이용 등의 규칙 위반 행위에
            대해 선제적으로 필터링하여 대응할 수 있도록, AI를 기반으로 시스템을
            지속적으로 발전시키고 있습니다.
            <br />
            <br />
            방송통신심의위원회의 정보통신에 관한 심의규정, 현행 법률, 서비스
            이용약관 및 커뮤니티 이용규칙 위반이 확인될 경우, 게시물이 삭제되고
            서비스 이용이 일정 기한 제한됩니다. 위반 횟수가 누적될수록 이용 제한
            기한 및 수준이 증가할 수 있습니다.
            <br />
            <br />
            단, 생명 경시 행위, 가족 및 고인 모독 행위, 성적 도의관념에 반하는
            행위, 비정상적 서비스 이용과 같이 중대한 커뮤니티 이용규칙 및 현행
            법률 위반 행위가 적발될 경우 즉시 1년 이상 서비스 이용이 제한됩니다.
            또한 노출 및 음란물 게시 행위, 범죄 및 불법 행위, 계정 판매 및 대리
            게시 행위, 홍보/판매 행위와 같이 서비스 이용약관 제12조 및 심각한
            현행 법률 위반 행위가 적발될 경우, 서비스 보호 및 안정적인 커뮤니티
            운영을 위해 서비스 이용약관 13조에 따라 5년 이상 서비스 이용이
            제한되거나, 영구적으로 서비스 이용계약이 해지되며 더 이상 서비스를
            이용하실 수 없습니다.
            <br />
            <br />
            이용 제한 시, 관련한 내용이 서비스 내부 알림 수단을 통해 개별
            통지되며, 제한 기한, 적용 범위, 근거 게시물 등 상세 내용을 [내
            정보]에서 확인하실 수 있습니다. 또한 개인정보 처리방침에 따른 기간
            동안 관련 개인정보 및 로그가 수집되어 파기되지 않고 보존됩니다.
            <br />
            <br />
            서비스 이용 중 서비스 이용 약관 및 커뮤니티 이용규칙에 어긋난다고
            판단되는 게시물 작성, 1:1 대화 발송, 게시판 개설, 닉네임 및 프로필
            사진 지정, 악용 행위를 발견하셨을 경우, 원활하고 신속한 처리를 위해
            해당 게시물의 신고 버튼을 눌러 신고해주시기 바랍니다. 신고 시 게시물
            처리 및 시스템 운영을 위해 최소한의 로그가 수집 및 보관되며, 1:1
            대화에 대한 신고가 접수된 경우에는 추가적으로 대화 내용 일부가
            일시적으로 저장될 수 있습니다.
          </p>
        </div>
      </div>
      <br />
      <div className=" p-3">
        <strong>유출 방지 시스템</strong>
        <br /> <br />
        <p>
          유출 방지 시스템은 게시물 및 자료를 외부로 유출하는 행위를 실시간으로
          감지하고 조치하기 위해 도입되었습니다.
          <br />
          <br />
          커뮤니티의 게시물을 복사·스크린샷·촬영하여 외부 사이트·대화방에
          게시하거나, 타인에게 관련한 내용을 공유하거나,
          게시판·시간표·강의평가를 크롤링하는 등 게시물 및 자료 유출이 적발될
          경우, 서비스 이용약관 13조에 따라 5년 이상 서비스 이용이 제한되거나,
          영구적으로 서비스 이용계약이 해지되며 더 이상 서비스를 이용하실 수
          없습니다. 만약 외부 유출을 발견하셨을 경우, 신고해주시기 바랍니다.
          <br />
          <br />
          모든 이용자는 외부 유출 행위로 인해 발생한 모든 피해에 대해 민형사상
          책임과 손해를 배상할 책임이 있습니다.
        </p>
      </div>
      <div className="p-3">
        <strong>금지 행위</strong>
        <br /> <br />
        <p>
          이용자 보호 및 원활한 서비스 제공을 위해 다음에 해당하는 게시물 작성,
          1:1 대화 발송, 게시판 개설, 닉네임 및 프로필 사진 지정, 악용 행위를
          금지하고 있습니다. <br />
          <br />본 커뮤니티 이용규칙은 방송통신심의위원회의 정보통신에 관한
          심의규정에 따른 심의기준을 기반으로 합니다.
        </p>
      </div>

      <div className="p-3">
        <strong>허위사실 유포 및 명예훼손 게시물에 대한 게시 중단 요청</strong>
        <br /> <br />
        <p>
          모든 게시물은 AI 커뮤니티 운영 시스템에 의해 처리되며, 요청에 의해
          사전 검토되거나 임의로 처리되지 않습니다.
          <br />
          <br />
          게시물로 인해 저작권 침해, 명예훼손, 기타 권리 침해를 당했다고
          판단되실 경우, 추가적인 권리 침해를 방지하기 위해 해당 게시물에 대한
          게시 중단 요청을 할 수 있습니다.
          <br />
          <br />
          이후 담당자의 확인을 통해 게시 중단 조치가 이루어지며, 게시 중단
          사유가 공개됩니다.
        </p>
      </div>
      <div className="p-3">
        <strong>전기통신사업법에 따른 불법촬영물 유통 금지</strong>
        <br /> <br />
        <p>
          회사는 전기통신사업법, 방송통신심의위원회의 정보통신에 관한 심의규정에
          따른 불법촬영물등 유해정보를 차단하기 위한 기술적·관리적 조치를 취하고
          있습니다.
          <br />
          <br />
          관련 법령에 따라 시스템에 의해 불법촬영물등 유해정보로 식별되는 자료는
          즉시 삭제 또는 블라인드 되고, 해당 게시물 작성자는 일시적으로 최대
          7일간 서비스 이용이 제한될 수 있습니다.
          <br />
          <br />
          모든 이용자는 외부 유출 행위로 인해 발생한 모든 피해에 대해 민형사상
          책임과 손해를 배상할 책임이 있습니다.
        </p>
      </div>
    </div>
  );
};

export default HowToUsePage;
