const PrivacyPage = () => {
  return (
    <div className="p-3">
      <div>
        <strong className="p-3">개인정보처리방침</strong>
        <hr />
      </div>

      <div>
        <strong className="p-3">1. 개인정보 처리방침</strong>
        <br />
        <div className=" p-3">
          <p>
            개인정보 처리방침은 에브리 한성(이하 "회사"라 합니다) 특정한
            가입절차를 거친 이용자들만 이용 가능한 폐쇄형 서비스를 제공함에
            있어, 개인정보를 어떻게 수집·이용·보관·파기하는지에 대한 정보를 담은
            방침을 의미합니다. 개인정보 처리방침은 개인정보보호법 등 국내
            개인정보 보호 법령을 모두 준수하고 있습니다. 본 개인정보
            처리방침에서 정하지 않은 용어의 정의는 서비스 이용약관을 따릅니다.
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">2. 수집하는 개인정보의 항목</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 서비스 제공을 위해 다음 항목 중 최소한의 개인정보를
            수집합니다.
            <br />
            1. 회원가입 시 수집되는 개인정보
            <li>
              학교, 아이디, 이메일, 이름, 휴대전화 번호, 통신사 정보, 생년월일,
              성별, 입학연도, 닉네임, 연계정보(CI, DI)
            </li>
            2. 별도로 수집되는 개인정보
            <li>
              학과, 학교 이메일, 학번, 수험번호, 마스킹 된 증빙 자료
              사본(학생증, 학교 포털 스크린샷, 학교 증명서)
            </li>
            <li>이름, 전화번호, 주소, 타 서비스 고유번호</li>
            <li>
              이메일, 학번, 학교 이메일, 회원정보, 기기정보, 문의내용에 포함된
              개인정보
            </li>
            <li>
              요청인·대리인 정보(이름·단체명, 생년월일·설립일, 마스킹 된 신분증
              사본, 연락처, 이메일, 증빙 자료 사본)
            </li>
            <br />※ 각 항목 또는 추가적으로 수집이 필요한 개인정보 및 개인정보를
            포함한 자료는 이용자 응대 과정과 서비스 내부 알림 수단 등을 통해
            별도의 동의 절차를 거쳐 요청·수집될 수 있습니다.
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">3. 수집한 개인정보의 처리 목적</strong>
        <br />
        <div className=" p-3">
          <p>
            <br />
            <li>
              가입 및 탈퇴 의사 확인, 회원 식별, 재학생 및 졸업생 확인 등 회원
              관리
            </li>
            <li>
              문의, 제휴 문의, 광고 문의, 게시 요청, 교내단체 게시판 개설 요청
              관련 응대 및 처리
            </li>
            <li>
              불법·약관 위반 게시물 게시 등 부정행위 방지를 위한 운영 시스템
              개발·유지·개선
            </li>
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">4. 개인정보의 제3자 제공</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 회원의 개인정보를 제3자에게 제공하지 않습니다. 단, 다음의
            사유가 있을 경우 제공할 수 있습니다.
            <br />
            <br />
            <li>
              회원이 제휴사의 서비스를 이용하기 위해 개인정보 제공을 회사에
              요청할 경우
            </li>
            <li>
              이용자의 생명이나 안전에 급박한 위험이 확인되어 이를 해소하기 위한
              경우
            </li>
            <li>관련법에 따른 규정에 의한 경우</li>
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">5. 개인정보 처리의 위탁</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 원활한 개인정보 업무처리와 보안성 높은 서비스 제공을 위하여,
            신뢰도가 검증된 다음 회사 및 서비스에 개인정보 관련 업무 처리를
            위탁하고 있습니다. 위탁계약 체결 시 회사는 기술적·관리적 보호조치 등
            수탁자에 대한 관리·감독을 하고 있습니다.
            <br />
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">6. 수집한 개인정보의 보관 및 파기</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 서비스를 제공하는 동안 개인정보 처리방침 및 관련법에 의거하여
            회원의 개인정보를 지속적으로 관리 및 보관합니다. 탈퇴 등 개인정보
            수집 및 이용목적이 달성될 경우, 수집된 개인정보는 즉시 또는 다음과
            같이 일정 기간 이후 파기됩니다.
            <br />※ 회원 탈퇴, 보관 기한 만료 등 파기 사유가 발생한 개인정보는
            재생이 불가능한 방법으로 파기됩니다. 전자적 파일 형태로 기록·저장된
            개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록·저장된
            개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">7. 정보주체의 권리, 의무 및 행사</strong>
        <br />
        <div className=" p-3">
          <p>
            회원은 언제든지 서비스 내부 [내 정보] 또는 에브리한성
            이메일(capstone23m@gmail.com)을 통해 자신의 개인정보를 조회하거나
            수정, 삭제, 탈퇴를 할 수 있습니다.
            <br />
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">8. 개인정보에 관한 책임자 및 서비스</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 회원의 개인정보를 최선으로 보호하고 관련된 불만을 처리하기
            위해 정보보호팀을 운영하고 있습니다.
            <br />
            기타 개인정보 침해에 대한 신고나 상담이 필요하신 경우에는 다음
            기관에 문의하시기 바랍니다.
            <br />
            <br />
            <li>
              개인정보 분쟁조정위원회 :
              <a href="https://www.kopico.go.kr">https://www.kopico.go.kr</a>
            </li>
            <li>
              사이버범죄 신고시스템 :
              <a href="https://ecrm.police.go.kr">https://ecrm.police.go.kr</a>
            </li>
          </p>
        </div>
      </div>
      <div>
        <strong className="p-3">9. 기타</strong>
        <br />
        <div className=" p-3">
          <p>이 개인정보 처리방침은 2023년 04월 04일에 개정되었습니다.</p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPage;
