const ServiceAgreementPage = () => {
  return (
    <div className="p-3">
      <div>
        <strong className="p-3">서비스 이용약관</strong>
        <hr />
      </div>

      <div>
        <strong className="p-3">제1조(목적)</strong>
        <br />
        <div className=" p-3">
          <p>
            에브리한성 서비스 이용약관은 에브리한성 서비스 이용과 관련하여
            개발자와 이용자 간의 권리, 의무 및 책임 사항 등을 규정함을 목적으로
            합니다.
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">제2조(정의)</strong>
        <br />
        <div className=" p-3">
          <p>
            이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
            <br />
            <li>"서비스"란, 회사가 제공하는 모든 서비스 및 기능을 말합니다.</li>
            <li>
              "이용자"란, 이 약관에 따라 서비스를 이용하는 회원 및 비회원을
              말합니다.
            </li>
            <li>
              "회원"이란, 서비스에 회원등록을 하고 서비스를 이용하는 자를
              말합니다.
            </li>
            <li>
              "비회원"이란, 서비스에 회원등록을 하지 않고 서비스를 이용하는 자를
              말합니다.
            </li>
            <li>
              "게시물"이란, 서비스에 게재된 문자, 사진, 영상, 첨부파일, 광고
              등을 말합니다.
            </li>
            <li>"커뮤니티"란, 게시물을 게시할 수 있는 공간을 말합니다.</li>
            <li>
              "이용 기록"이란, 이용자가 서비스를 이용하면서 직접 생성한 시간표,
              친구, 학점 정보 등을 말합니다.
            </li>
            <li>
              "계정"이란, 이용계약을 통해 생성된 회원의 고유 아이디와 이에
              수반하는 정보를 말합니다.
            </li>
            <li>
              "관련법"이란, 정보통신망 이용촉진 및 정보보호 등에 관한 법률,
              전기통신사업법, 개인정보보호법 등 관련 있는 국내 법령을 말합니다.
            </li>
            <li>
              "학교 인증"이란, 학생증, 학교 웹메일, 증명서 등을 이용한 학적 확인
              절차를 말합니다.
            </li>
            <li>
              제1항에서 정의되지 않은 이 약관 내 용어의 의미는 일반적인
              이용관행에 의합니다.
            </li>
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">제3조(약관 등의 명시와 설명 및 개정)</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 이 약관을 서비스 초기화면, 회원가입 화면 및 "내 정보" 메뉴
            등에 게시하거나 기타의 방법으로 회원에게 공지합니다.
            <br />
            <li>
              회사는 필요하다고 인정되는 경우, 관련법을 위배하지 않는 범위에서
              이 약관을 개정할 수 있습니다.
            </li>
            <li>
              회사는 약관을 개정할 경우, 적용 일자 및 개정 사유를 명시하여
              현행약관과 함께 개정약관 적용 일자 7일 전부터 "공지사항"을 통해
              공지합니다. 다만, 개정 내용이 회원의 권리 및 의무에 중대한 영향을
              미치는 경우에는 적용 일자 30일 전부터 회원의 연락처 또는 서비스
              내부 알림 수단으로 개별 공지합니다.
            </li>
            <li>
              회원은 개정 약관에 동의하지 않을 경우, 제7조(서비스 이용계약의
              종료)에 따른 회원 탈퇴 방법으로 거부 의사를 표시할 수 있습니다.
              단, 회사가 약관 개정 시 "개정 약관의 적용 일자까지 회원이 거부
              의사를 표시하지 아니할 경우 약관의 개정에 동의한 것으로
              간주한다"는 내용을 고지하였음에도 불구하고 회원이 약관 개정에 대한
              거부 의사를 표시하지 아니하면, 회사는 적용 일자부로 개정 약관에
              동의한 것으로 간주합니다.
            </li>
            <li>회원은 약관 일부분만을 동의 또는 거부할 수 없습니다.</li>
            <li>
              회사는 제1항부터 제4항까지를 준수하였음에도 불구하고 회원이 약관
              개정 사실을 알지 못함으로써 발생한 피해에 대해 회사의 고의 또는
              중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.
            </li>
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">제4조(서비스의 제공)</strong>
        <br />
        <div className=" p-3">
          <p>
            회사는 다음 서비스를 제공합니다.
            <br />
            <li>시간표, 학점계산기 등 대학 생활 편의 서비스</li>
            <li>대학교별 폐쇄형 커뮤니티 서비스</li>
            <li>대학, 문화, 활동, 취업 정보 제공 서비스</li>
            <li>기타 회사가 정하는 서비스</li>
            <li>
              에브리한성은 학생증, 학교 웹메일, 증명서 등을 통해 해당 대학교의
              학부 재학생 및 졸업생 또는 해당연도 입학생으로 인증받은 이용자에
              한해 커뮤니티를 이용할 수 있는 폐쇄형 서비스입니다. 에브리타임은
              대학교별로 개별 운영되므로, 학교 인증을 받지 않은 이용자 및 불특정
              다수의 일반 이용자는 커뮤니티를 포함한 대부분의 기능에 접근할 수
              없습니다.스
            </li>
            <li>
              회사는 운영상, 기술상의 필요에 따라 제공하고 있는 서비스를 변경할
              수 있습니다.
            </li>
            <li>
              회사는 이용자의 개인정보 및 서비스 이용 기록에 따라 서비스 이용에
              차이를 둘 수 있습니다.
            </li>
            <li>
              회사는 설비의 보수, 교체, 점검 또는 기간통신사업자의 서비스 중지,
              인터넷 장애 등의 사유로 인해 일시적으로 서비스 제공이 어려울 경우,
              통보 없이 일시적으로 서비스 제공을 중단할 수 있습니다.
            </li>
            <li>
              회사는 천재지변, 전쟁, 경영 악화 등 불가항력적인 사유로 인해
              서비스를 더 이상 제공하기 어려울 경우, 통보 없이 서비스 제공을
              영구적으로 중단할 수 있습니다.
            </li>
            <li>
              회사는 제4항부터 제6항까지 및 다음 내용으로 인해 발생한 피해에
              대해 회사의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지
              않습니다.
            </li>
          </p>
        </div>
      </div>

      <div>
        <strong className="p-3">제5조(서비스 이용계약의 성립)</strong>
        <br />
        <div className=" p-3">
          <p>
            회사와 회원의 서비스 이용계약은 서비스를 이용하고자 하는 자(이하
            "가입 신청자"라고 합니다)가 서비스 내부의 회원가입 양식에 따라
            필요한 회원정보를 기입하고, 이 약관, 개인정보 수집 및 이용 동의,
            커뮤니티 이용규칙 등에 명시적인 동의를 한 후, 신청한 회원가입 의사
            표시(이하 "이용신청"이라 합니다)를 회사가 승낙함으로써 체결됩니다.
            <br />
            <li>
              제1항의 승낙은 신청순서에 따라 순차적으로 처리되며, 회원가입의
              성립 시기는 회사의 회원가입이 완료되었음을 알리는 승낙의 통지가
              회원에게 도달하거나, 이에 준하는 권한이 회원에게 부여되는 시점으로
              합니다.
            </li>
            <li>
              회사는 만 14세 미만 이용자의 이용신청을 금지하고 있습니다. 가입
              신청자는 이용신청 시 만 14세 이상에 해당한다는 항목에 명시적인
              동의를 함으로써 회원은 만 14세 이상임을 진술하고 보증합니다.
            </li>
            <li>
              회사는 부정사용방지 및 본인확인을 위해 회원에게 본인 인증 및 학교
              인증을 요청할 수 있습니다.
            </li>
            <li>
              회사는 가입 신청자의 이용신청에 있어, 이용신청을 영구적으로
              승낙하지 않거나 유보할 수 있습니다.
            </li>
            <li>
              회사는 제3항부터 제5항까지로 인해 발생한 피해에 대해 회사의 고의
              또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.
            </li>
          </p>
        </div>
      </div>
    </div>
  );
};

export default ServiceAgreementPage;
